run/square/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    back
    {
        type            empty;
        physicalType    empty;
        nFaces          946;
        startFace       1379;
    }
    front
    {
        type            empty;
        physicalType    empty;
        nFaces          946;
        startFace       2325;
    }
    bottom
    {
        type            symmetryPlane;
        physicalType    symmetryPlane;
        nFaces          20;
        startFace       3271;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          20;
        startFace       3291;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          20;
        startFace       3311;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          20;
        startFace       3331;
    }
)

// ************************************************************************* //
