run/square/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0 0 0)
    (10 0 0)
    (10 1 0)
    (0 1 0)
    (0 0 1)
    (10 0 1)
    (10 1 1)
    (0 1 1)
    (2 0 0.5)   // Vertex 8 (sloped bottom point)
);

blocks
(
    hex (0 8 1 3 4 8 5 7) (10 10 10) simpleGrading (1 1 1)
    hex (8 1 2 3 8 5 6 7) (10 10 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type wall;
        faces
        (
            (1 5 6 2)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 8 1 3)
        );
    }
    top
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
        );
    }
);

mergePatchPairs
(
);

